Catalogs/СтатьиНалоговыхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СтатьиНалоговыхДеклараций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалоговойДекларации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыНалоговыхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНалоговыхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДекларацияПоНалогуНаПрибыль2015</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пенсионный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безработица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НесчастныйСлучай</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтратаТрудоспобности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕдиныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоТруду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОбИспользованииРабочегоВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияОПрибыли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияПоНалогуНаПрибыльНКУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекларацияПоАкцизномуНалогу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтатьиНалоговыхДеклараций/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ВидНалоговойДекларации, НаборСтатейНалоговыхДеклараций");
	
	Если ЗначениеЗаполнено(ВидНалоговойДекларации) Тогда		
		Элементы.ФильтрВидНалоговойДекларации.Доступность = Ложь;
		ФильтрВидНалоговойДекларацииПриИзмененииНаСервере();
	КонецЕсли;
	
	Элементы.ФильтрНаборСтатейНалоговыхДеклараций.Доступность = ЗначениеЗаполнено(ВидНалоговойДекларации);
	Элементы.ДекорацияФильтрНаборСтатейНалоговыхДеклараций.Заголовок = ""; 
	
	Элементы.Описание.Видимость = (ВидНалоговойДекларации = ПредопределенноеЗначение("Перечисление.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильтрВидНалоговойДекларацииПриИзменении(Элемент)
	
	ФильтрВидНалоговойДекларацииПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ФильтрНаборСтатейНалоговыхДекларацийПриИзменении(Элемент)
	
	ФильтрНаборСтатейНалоговыхДекларацийПриИзмененииНаСервере();

	Элементы.ДекорацияФильтрНаборСтатейНалоговыхДеклараций.Видимость = ЗначениеЗаполнено(НаборСтатейНалоговыхДеклараций);

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	 
	Если ЗначениеЗаполнено(НаборСтатейНалоговыхДеклараций) 
	   И Не Элемент.ТекущиеДанные.ЭтоРекомендованнаяСтатья Тогда
	   
		СтандартнаяОбработка = Ложь;
		Элементы.Список.Развернуть(ВыбраннаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ФильтрВидНалоговойДекларацииПриИзмененииНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"ВидНалоговойДекларации",
		ВидНалоговойДекларации,
		ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ВидНалоговойДекларации)
	);
	
	Элементы.ФильтрНаборСтатейНалоговыхДеклараций.Доступность = ЗначениеЗаполнено(ВидНалоговойДекларации);	
	Элементы.Описание.Видимость = (ВидНалоговойДекларации = ПредопределенноеЗначение("Перечисление.ВидыНалоговыхДеклараций.ДекларацияПоНалогуНаПрибыльНКУ"));
	
КонецПроцедуры

&НаСервере
Процедура ФильтрНаборСтатейНалоговыхДекларацийПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(НаборСтатейНалоговыхДеклараций) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"Ссылка",
			Новый СписокЗначений,
			ВидСравненияКомпоновкиДанных.ВСписке,,Ложь
		);
		Возврат;
	КонецЕсли;
			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор,
		"Ссылка",
		Справочники.СтатьиНалоговыхДеклараций.ПолучитьСписокСтатейПоНаборуСтатей(НаборСтатейНалоговыхДеклараций, Истина),
		ВидСравненияКомпоновкиДанных.ВСписке,,Истина
	);
	
КонецПроцедуры
 
#КонецОбласти
